---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDepth
source: html/7f73320f-b390-ba98-f050-05916f50027c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDepth Property

"Hole Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleDepth { get; }
```